particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    void handleDevStateChanged(T_GAP_DEV_STATE state, uint16_t cause);
    void handleConnectionStateChanged(uint8_t connHandle, T_GAP_CONN_STATE newState, uint16_t discCause);
    void handleMtuUpdated(uint8_t connHandle, uint16_t mtuSize);
    void handleConnParamsUpdated(uint8_t connHandle, uint8_t status, uint16_t cause);
    int handleAuthenStateChanged(uint8_t connHandle, uint8_t state, uint16_t cause);
    int handlePairJustWork(uint8_t connHandle);
    int handlePairPasskeyDisplay(uint8_t connHandle, bool displayOnly = true);
    int handlePairPasskeyInput(uint8_t connHandle);

    int onPeripheralLinkEventCallback(hal_ble_on_link_evt_cb_t cb, void* context) {
        std::pair<hal_ble_on_link_evt_cb_t, void*> callback(cb, context);
        CHECK_TRUE(periphEvtCallbacks_.append(callback), SYSTEM_ERROR_NO_MEMORY);
        return SYSTEM_ERROR_NONE;
    }

    static BleGap& getInstance() {
        static BleGap instance;
        return instance;
    }

    int onAdvEventCallback(hal_ble_on_adv_evt_cb_t callback, void* context);
    void cancelAdvEventCallback(hal_ble_on_adv_evt_cb_t callback, void* context);

private:
    enum BlePairingState {
        BLE_PAIRING_STATE_NOT_INITIATED,
        BLE_PAIRING_STATE_INITIATED, // Central role only
        BLE_PAIRING_STATE_STARTED,
        BLE_PAIRING_STATE_USER_REQ_REJECT,
        BLE_PAIRING_STATE_SET_AUTH_DATA,
        BLE_PAIRING_STATE_REJECTED,
        BLE_PAIRING_STATE_PAIRED
    };

    struct BleConnection {
        hal_ble_conn_info_t info;
        std::pair<hal_ble_on_link_evt_cb_t, void*> handler; // It is used for central link only.
        BlePairingState pairState;
    };

    BleGap()
            : initialized_(false),
              btStackStarted_(false),
              state_{},
              addr_{},
              advParams_{},
              advTimeoutTimer_(nullptr),
              advScheduled_(false),
              isScanning_(false),
              scanParams_{},
              scanSemaphore_(nullptr),
              scanResultCallback_(nullptr),
              context_(nullptr),
              periphEvtCallbacks_{},
              connectingAddr_{},
              connectSemaphore_(nullptr),
              disconnectSemaphore_(nullptr),
              disconnectingHandle_(BLE_INVALID_CONN_HANDLE),
              connecting_(false),
              ppcp_{},
              pairingConfig_{},
              devNameLen_(0),
              isAdvertising_(false),
              stateSemaphore_(nullptr) {
        advParams_.version = BLE_API_VERSION;
        advParams_.size = sizeof(hal_ble_adv_params_t);
        advParams_.interval = BLE_DEFAULT_ADVERTISING_INTERVAL;
        advParams_.timeout = BLE_DEFAULT_ADVERTISING_TIMEOUT;
        advParams_.type = BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT;
        advParams_.filter_policy = BLE_ADV_FP_ANY;
        advParams_.inc_tx_power = false;
        advParams_.primary_phy = 0; // Not used

        scanParams_.version = BLE_API_VERSION;
        scanParams_.size = sizeof(hal_ble_scan_params_t);
        scanParams_.active = true;
        scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
        scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
        scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
        scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;
        scanParams_.scan_phys = BLE_PHYS_AUTO;

        ppcp_.version = BLE_API_VERSION;
        ppcp_.size = sizeof(hal_ble_conn_params_t);
        ppcp_.min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL;
        ppcp_.max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL;
        ppcp_.slave_latency = BLE_DEFAULT_SLAVE_LATENCY;
        ppcp_.conn_sup_timeout = BLE_DEFAULT_CONN_SUP_TIMEOUT;

        memset(advData_, 0x00, sizeof(advData_));
        memset(scanRespData_, 0x00, sizeof(scanRespData_));
        advDataLen_ = scanRespDataLen_ = 0;
        /* Default advertising data. */
        // FLags
        advData_[advDataLen_++] = 0x02; // Length field of an AD structure, it is the length of the rest AD structure data.
        advData_[advDataLen_++] = BLE_SIG_AD_TYPE_FLAGS; // Type field of an AD structure.
        advData_[advDataLen_++] = BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; // Payload field of an AD structure.

        pairingConfig_ = {
            .version = BLE_API_VERSION,
            .size = sizeof(hal_ble_pairing_config_t),
            .io_caps = BLE_IO_CAPS_NONE,
            .algorithm = BLE_PAIRING_ALGORITHM_AUTO,
            .reserved = {}
        };
    }
    ~BleGap() = default;

    T_GAP_ADTYPE toPlatformAdvEvtType(hal_ble_adv_evt_type_t type) const {
        switch (type) {
            case BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT:
            case BLE_ADV_CONNECTABLE_UNDIRECTED_EVT: {
                return GAP_ADTYPE_ADV_IND;
            }
            case BLE_ADV_CONNECTABLE_DIRECTED_EVT: {
                return GAP_ADTYPE_ADV_HDC_DIRECT_IND;
            }
            case BLE_ADV_NON_CONNECTABLE_NON_SCANABLE_UNDIRECTED_EVT:
            case BLE_ADV_NON_CONNECTABLE_NON_SCANABLE_DIRECTED_EVT: {
                return GAP_ADTYPE_ADV_NONCONN_IND;
            }
            case BLE_ADV_SCANABLE_UNDIRECTED_EVT:
            case BLE_ADV_SCANABLE_DIRECTED_EVT: {
                return GAP_ADTYPE_ADV_SCAN_IND;
            }
            default:{
                return GAP_ADTYPE_ADV_IND;
            }
        }
    }

    RtlGapDevState getState() const {
        RtlGapDevState s;
        s.raw = state_.raw;
        return s;
    }

    void notifyScanResult(T_LE_SCAN_INFO* advReport);
    hal_ble_scan_result_evt_t* getPendingResult(const hal_ble_addr_t& address);
    int addPendingResult(const hal_ble_scan_result_evt_t& resultEvt);
    void removePendingResult(const hal_ble_addr_t& address);
    void clearPendingResult();

    bool connectedAsBlePeripheral() const {
        for (auto& connection : connections_) {
            if (connection.info.role == BLE_ROLE_PERIPHERAL) {
                return true;
            }
        }
        return false;
    }

    BleConnection* fetchConnection(hal_ble_conn_handle_t connHandle);
    BleConnection* fetchConnection(const hal_ble_addr_t* address);
    int addConnection(BleConnection&& connection);
    void removeConnection(hal_ble_conn_handle_t connHandle);

    void notifyLinkEvent(const hal_ble_link_evt_t& event);

    static T_APP_RESULT gapEventCallback(uint8_t type, void *data);
    static void onAdvTimeoutTimerExpired(os_timer_t timer);

    struct BleAdvEventHandler {
        hal_ble_on_adv_evt_cb_t callback;
        void* context;
    };

    bool initialized_;
    bool btStackStarted_;
    volatile RtlGapDevState state_;                 /**< This should be atomically r/w as the struct is <= uint32_t */
    hal_ble_addr_t addr_;
    hal_ble_adv_params_t advParams_;
    os_timer_t advTimeoutTimer_;                    /**< Timer for advertising timeout.  */
    volatile bool advScheduled_;
    volatile bool isScanning_;                      /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;              /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                  /**< Semaphore to wait until the scan procedure completed. */
    hal_ble_on_scan_result_cb_t scanResultCallback_;    /**< Callback function on scan result. */
    void* context_;                                     /**< Context of the scan result callback function. */
    Vector<hal_ble_scan_result_evt_t> pendingResults_;
    Vector<std::pair<hal_ble_on_link_evt_cb_t, void*>> periphEvtCallbacks_;
    hal_ble_addr_t connectingAddr_;                 /**< Address of peer the Central is connecting to. */
    os_semaphore_t connectSemaphore_;               /**< Semaphore to wait until connection established. */
    std::pair<hal_ble_on_link_evt_cb_t, void*> centralLinkCbCache_; // It is used for central link only.
    os_semaphore_t disconnectSemaphore_;            /**< Semaphore to wait until connection disconnected. */
    volatile hal_ble_conn_handle_t disconnectingHandle_;    /**< Handle of connection to be disconnected. */
    Vector<BleConnection> connections_;
    volatile bool connecting_;
    hal_ble_conn_params_t ppcp_;
    hal_ble_pairing_config_t pairingConfig_;
    uint8_t advData_[BLE_MAX_ADV_DATA_LEN];         /**< Current advertising data. */
    size_t advDataLen_;                             /**< Current advertising data length. */
    uint8_t scanRespData_[BLE_MAX_ADV_DATA_LEN];    /**< Current scan response data. */
    size_t scanRespDataLen_;                        /**< Current scan response data length. */
    char devName_[BLE_MAX_DEV_NAME_LEN + 1];        // null-terminated
    size_t devNameLen_;
    static constexpr uint16_t BLE_ADV_TIMEOUT_EXT_MS = 50;
    volatile bool isAdvertising_;
    os_semaphore_t stateSemaphore_;
    Vector<BleAdvEventHandler> advEventHandlers_;
    Mutex advEventMutex_;

