particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    memcpy(&connectingAddr_, &config->address, sizeof(hal_ble_addr_t));
    uint8_t connLocalAddrType = GAP_LOCAL_ADDR_LE_PUBLIC;
    if (addr_.addr_type == BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        connLocalAddrType = GAP_LOCAL_ADDR_LE_RANDOM;
    }
    centralLinkCbCache_.first = config->callback;
    centralLinkCbCache_.second = config->context;
    connecting_ = true;
    CHECK_RTL(le_connect(GAP_CONN_PARAM_1M, connectingAddr_.addr, (T_GAP_REMOTE_ADDR_TYPE)connectingAddr_.addr_type,
        (T_GAP_LOCAL_ADDR_TYPE)connLocalAddrType, BLE_DEFAULT_SCANNING_TIMEOUT));
    if (os_semaphore_take(connectSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    BleConnection* connection = fetchConnection(&config->address);
    CHECK_TRUE(connection, SYSTEM_ERROR_INTERNAL);
    *connHandle = connection->info.conn_handle;
    return SYSTEM_ERROR_NONE;
}

int BleGap::connectCancel(const hal_ble_addr_t* address) {
    CHECK_TRUE(connecting_, SYSTEM_ERROR_INVALID_STATE);
    CHECK_TRUE(address, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addressEqual(connectingAddr_, *address), SYSTEM_ERROR_INVALID_ARGUMENT);
    // NOTE: there is no API to cancel on-going connection attempt
    // We have to wait until it is connected followed by calling the disconnect API
    if (!WAIT_TIMED(BLE_OPERATION_TIMEOUT_MS, connecting_)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    auto connection = fetchConnection(address);
    CHECK_TRUE(connection, SYSTEM_ERROR_NONE); // Connection is not established
    CHECK(disconnect(connection->info.conn_handle));
    return SYSTEM_ERROR_NONE;
}

int BleGap::disconnect(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(fetchConnection(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    disconnectingHandle_ = connHandle;
    CHECK_RTL(le_disconnect(connHandle));
    if (os_semaphore_take(disconnectSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::disconnectAll() {
    for (const auto& connection : connections_) {
        // TODO: check the return value.
        disconnect(connection.info.conn_handle);
        // The corresponding connection in the Vector will be removed on the disconnected event.
    }
    return SYSTEM_ERROR_NONE;
}

void BleGap::notifyLinkEvent(const hal_ble_link_evt_t& event) {
    BleConnection* connection = fetchConnection(event.conn_handle);
    if (connection) {
        if (connection->info.role == BLE_ROLE_CENTRAL) {
            if (connection->handler.first) {
                connection->handler.first(&event, connection->handler.second);
            }
        } else {
            for (const auto& handler : periphEvtCallbacks_) {
                if (handler.first) {
                    handler.first(&event, handler.second);
                }
            }
        }
    }
}

bool BleGap::valid(hal_ble_conn_handle_t connHandle) {
    const BleConnection* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

BleGap::BleConnection* BleGap::fetchConnection(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(connHandle != BLE_INVALID_CONN_HANDLE, nullptr);
    for (auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            return &connection;
        }
    }
    return nullptr;
}

BleGap::BleConnection* BleGap::fetchConnection(const hal_ble_addr_t* address) {
    CHECK_TRUE(address, nullptr);
    for (auto& connection : connections_) {
        if (addressEqual(connection.info.address, *address)) {
            return &connection;
        }
    }
    return nullptr;
}

int BleGap::addConnection(BleConnection&& connection) {
    CHECK_TRUE(fetchConnection(connection.info.conn_handle) == nullptr, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(connections_.append(std::move(connection)), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleGap::removeConnection(hal_ble_conn_handle_t connHandle) {
    size_t i = 0;
    for (const auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            connections_.removeAt(i);
            return;
        }
        i++;
    }
}

int BleGap::setPairingConfig(const hal_ble_pairing_config_t* config) {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_FALSE(connected(nullptr), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(isScanning_, SYSTEM_ERROR_INVALID_STATE);
    bool adv = isAdvertising();
    bool ok = false;
    SCOPE_GUARD({
        if (ok && adv) {
            startAdvertising();
        }
    });
    if (btStackStarted_) {
        CHECK(stop());
        CHECK(init());
    }
    // Bit mask: GAP_AUTHEN_BIT_BONDING_FLAG, GAP_AUTHEN_BIT_MITM_FLAG, GAP_AUTHEN_BIT_SC_FLAG
    uint16_t authFlags = 0;
    if (config->algorithm != BLE_PAIRING_ALGORITHM_LEGACY_ONLY) {
        authFlags = GAP_AUTHEN_BIT_SC_FLAG;
    }
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_AUTHEN_REQUIREMENTS_FLAGS, sizeof(authFlags), &authFlags));
    // IO Capabilities
    uint8_t ioCaps = toPlatformIoCaps(config->io_caps);
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_IO_CAPABILITIES, sizeof(ioCaps), &ioCaps));
    uint16_t secReqFlags = authFlags;
    if (config->io_caps != BLE_IO_CAPS_NONE) {
        secReqFlags |= GAP_AUTHEN_BIT_MITM_FLAG;
    }
    CHECK_RTL(le_bond_set_param(GAP_PARAM_BOND_SEC_REQ_REQUIREMENT, sizeof(secReqFlags), &secReqFlags));
    pairingConfig_ = {};
    pairingConfig_.size = sizeof(hal_ble_pairing_config_t);
    memcpy(&pairingConfig_, config, std::min(pairingConfig_.size, config->size));

    CHECK(start());

    ok = true;
    return SYSTEM_ERROR_NONE;
}

int BleGap::getPairingConfig(hal_ble_pairing_config_t* config) const {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(config, &pairingConfig_, std::min(pairingConfig_.size, config->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setPairingAuthData(hal_ble_conn_handle_t connHandle, const hal_ble_pairing_auth_data_t* auth) {
    CHECK_TRUE(auth, SYSTEM_ERROR_INVALID_ARGUMENT);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    if (auth->type == BLE_PAIRING_AUTH_DATA_NUMERIC_COMPARISON) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_STARTED, SYSTEM_ERROR_INVALID_STATE);
        connection->pairState = BLE_PAIRING_STATE_SET_AUTH_DATA;
        if (auth->params.equal) {
            CHECK_RTL(le_bond_user_confirm(connHandle, GAP_CFM_CAUSE_ACCEPT));
        } else {
            CHECK_RTL(le_bond_user_confirm(connHandle, GAP_CFM_CAUSE_REJECT));
        }
    }
    else if (auth->type == BLE_PAIRING_AUTH_DATA_PASSKEY) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_STARTED, SYSTEM_ERROR_INVALID_STATE);
        connection->pairState = BLE_PAIRING_STATE_SET_AUTH_DATA;
        for (uint8_t i = 0; i < BLE_PAIRING_PASSKEY_LEN; i++) {
            if (!std::isdigit(auth->params.passkey[i])) {
                LOG(ERROR, "Invalid digits.");
                CHECK_RTL(le_bond_passkey_input_confirm(connHandle, 0, GAP_CFM_CAUSE_REJECT));
                return SYSTEM_ERROR_INVALID_ARGUMENT;
            }
        }
        uint32_t passkey = std::atoi((const char*)auth->params.passkey);
        CHECK_RTL(le_bond_passkey_input_confirm(connHandle, passkey, GAP_CFM_CAUSE_ACCEPT));
    }
    else {
        LOG(ERROR, "SYSTEM_ERROR_NOT_SUPPORTED");
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

