particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleGap::startPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_NOT_INITIATED ||
               connection->pairState == BLE_PAIRING_STATE_REJECTED, SYSTEM_ERROR_INVALID_STATE);
    connection->pairState = BLE_PAIRING_STATE_INITIATED;
    auto ret = le_bond_pair(connHandle);
    if (ret != GAP_CAUSE_SUCCESS) {
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.pairing_status.status = rtl_ble_error_to_system(ret);
        notifyLinkEvent(linkEvent);
        connection->pairState = BLE_PAIRING_STATE_NOT_INITIATED;
        return rtl_ble_error_to_system(ret);
    }
    return SYSTEM_ERROR_NONE;
}

/*
 * User may reject pairing under the following circumstances

 * If just work is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 * 
 * If passkey display is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_PASSKEY_DISPLAY received
 * 
 * If numeric comparison is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 *   3. choosing "NO" on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 *   4. not setting authentication data on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 * 
 * If passkey input is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_PASSKEY_INPUT received
 *   3. entering wrong passkey on BLE_EVT_PAIRING_PASSKEY_INPUT received
 *   4. not setting authentication data on BLE_EVT_PAIRING_PASSKEY_INPUT received
 * 
 * Other circumstances are considered to continue the pairing process。
 */
int BleGap::rejectPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    // Note: If user called rejectPairing() after setPairingAuthData(), it won't take any effect
    if (connection->pairState == BLE_PAIRING_STATE_INITIATED || connection->pairState == BLE_PAIRING_STATE_STARTED) {
        connection->pairState = BLE_PAIRING_STATE_USER_REQ_REJECT;
    }
    return SYSTEM_ERROR_NONE;
}

bool BleGap::isPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return connection->pairState == BLE_PAIRING_STATE_INITIATED ||
           connection->pairState == BLE_PAIRING_STATE_STARTED ||
           connection->pairState == BLE_PAIRING_STATE_SET_AUTH_DATA ||
           connection->pairState == BLE_PAIRING_STATE_USER_REQ_REJECT;
}

bool BleGap::isPaired(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return connection->pairState == BLE_PAIRING_STATE_PAIRED;
}

int BleGap::waitState(BleGapDevState state, system_tick_t timeout, bool forcePoll) {
    auto current = BleGapDevState(getState());
    if (forcePoll || current.isNotInitialized() || !btStackStarted_) {
        // Poll, as some of the initial events are missing
        RtlGapDevState s;
        auto start = hal_timer_millis(nullptr);
        while (hal_timer_millis(nullptr) - start < timeout) {
            CHECK_RTL(le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state));
            if (BleGapDevState(s).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
            HAL_Delay_Milliseconds(BLE_WAIT_STATE_POLL_PERIOD_MS);
        }
    } else {
        auto end = hal_timer_millis(nullptr) + timeout;
        for (auto now = hal_timer_millis(nullptr); now < end; now = hal_timer_millis(nullptr)) {
            os_semaphore_take(stateSemaphore_, end - now, false);
            if (BleGapDevState(getState()).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
        }
    }
    LOG(ERROR, "Timeout waiting state");
    return SYSTEM_ERROR_TIMEOUT;
}

void BleGap::handleDevStateChanged(T_GAP_DEV_STATE newState, uint16_t cause) {
    LOG_DEBUG(TRACE, "GAP state updated, init:%d, adv:%d, adv-sub:%d, scan:%d, conn:%d, cause:%d",
                        newState.gap_init_state, newState.gap_adv_state, newState.gap_adv_sub_state, newState.gap_scan_state, newState.gap_conn_state, cause);
    RtlGapDevState nState;
    nState.state = newState;
    // NOTE: this event is generated before the connection is established
    if (newState.gap_adv_state != state_.state.gap_adv_state && newState.gap_adv_state == GAP_ADV_STATE_IDLE) {
        if (newState.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN) {
            stopAdvertising(false);
        } else if (advScheduled_) {
            advScheduled_ = false;
            startAdvertising(false);
        }
    }
    state_.raw = nState.raw;
    os_semaphore_give(stateSemaphore_, false);
}

void BleGap::handleConnectionStateChanged(uint8_t connHandle, T_GAP_CONN_STATE newState, uint16_t discCause) {
    switch (newState) {
        case GAP_CONN_STATE_CONNECTING: {
            LOG_DEBUG(TRACE, "Connecting...");
            connecting_ = true;
            break;
        }
        case GAP_CONN_STATE_DISCONNECTING: {
            LOG_DEBUG(TRACE, "Disconnecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTED: {
            LOG_DEBUG(TRACE, "GAP_CONN_STATE_DISCONNECTED");
            BleConnection* connection = fetchConnection(connHandle);
            if (!connection) {
                LOG(TRACE, "Connection not found.");
                if (connecting_) {
                    connecting_ = false;
                    // Central failed to connect
                    os_semaphore_give(connectSemaphore_, false);
                }
                return;
            }
            BleConnection stalledConnection = *connection;
            removeConnection(connHandle);
            if ((discCause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE)) && (discCause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE))) {
                LOG_DEBUG(TRACE, "handleConnectionStateChanged: connection lost cause 0x%x", discCause);
                hal_ble_addr_t addr = {};
                if (!addressEqual(connectingAddr_, addr)) {
                    LOG(ERROR, "Central gets disconnected while connecting.....");
                }
            }
            LOG_DEBUG(TRACE, "Disconnected, handle:%d, cause:0x%x", connHandle, discCause);
            // If the disconnection is initiated by application.
            if (disconnectingHandle_ == stalledConnection.info.conn_handle) {
                os_semaphore_give(disconnectSemaphore_, false);
            } else {
                // Notify the disconnected event.
                hal_ble_link_evt_t evt = {};
                evt.type = BLE_EVT_DISCONNECTED;
                evt.conn_handle = connHandle;
                evt.params.disconnected.reason = (uint8_t)discCause;
                if (stalledConnection.info.role == BLE_ROLE_CENTRAL) {
                    if (stalledConnection.handler.first) {
                        stalledConnection.handler.first(&evt, stalledConnection.handler.second);
                    }
                } else {
                    for (const auto& handler : periphEvtCallbacks_) {
                        if (handler.first) {
                            handler.first(&evt, handler.second);
                        }
                    }
                }
            }
            BleGatt::getInstance().removeSubscriber(connHandle);
            if (stalledConnection.info.role == BLE_ROLE_PERIPHERAL) {
                // FIXME: check whether it's enabled?
                if (isAdvertising()) {
                    stopAdvertising(false);
                    // Re-start advertising after the adv-stopped event received
                    advScheduled_ = true;
                } else {
                    startAdvertising(false);
                }
            }
            break;
        }
        case GAP_CONN_STATE_CONNECTED: {
            LOG_DEBUG(TRACE, "GAP_CONN_STATE_CONNECTED");
            hal_ble_conn_params_t connParams = {};
            connParams.version = BLE_API_VERSION;
            connParams.size = sizeof(hal_ble_conn_params_t);
            hal_ble_addr_t peerAddr = {};
            peerAddr.addr_type = BLE_SIG_ADDR_TYPE_PUBLIC;
            le_get_conn_addr(connHandle, peerAddr.addr, (uint8_t *)&peerAddr.addr_type);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connParams.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connParams.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "Connected, interval:0x%x, latency:0x%x, timeout:0x%x",
                            connParams.max_conn_interval, connParams.slave_latency, connParams.conn_sup_timeout);

            BleConnection connection = {};
            connection.info.version = BLE_API_VERSION;
            connection.info.size = sizeof(hal_ble_conn_info_t);
            if (addressEqual(connectingAddr_, peerAddr)) {
                connection.info.role = BLE_ROLE_CENTRAL;
                connection.handler = centralLinkCbCache_;
                LOG_DEBUG(TRACE, "Connected as Central");
            } else {
                connection.info.role = BLE_ROLE_PERIPHERAL;
                LOG_DEBUG(TRACE, "Connected as Peripheral");
            }
            connection.info.conn_handle = connHandle;
            connection.info.conn_params = connParams;
            connection.info.address = peerAddr;
            connection.info.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
            connection.pairState = BLE_PAIRING_STATE_NOT_INITIATED;
            int ret = addConnection(std::move(connection));
            if (ret != SYSTEM_ERROR_NONE) {
                LOG(ERROR, "Add new connection failed. Disconnects from peer.");
                disconnect(connHandle);
                return;
            }

            if (connection.info.role == BLE_ROLE_PERIPHERAL) {
                hal_ble_link_evt_t evt = {};
                evt.type = BLE_EVT_CONNECTED;
                evt.conn_handle = connHandle;
                evt.params.connected.info = &connection.info;
                notifyLinkEvent(evt);
            } else {
                // See: handleMtuUpdated()
                // os_semaphore_give(connectSemaphore_, false);
            }
            break;
        }
        default: break;
    }
}

void BleGap::handleMtuUpdated(uint8_t connHandle, uint16_t mtuSize) {
    LOG_DEBUG(TRACE, "handleMtuUpdated: handle:%d, mtu_size:%d", connHandle, mtuSize);
    BleConnection* connection = fetchConnection(connHandle);
    if (!connection) {
        return;
    }
    // FIXME: when device initiates the connection establishment,
    // it will perform the ATT MTU exchange automatically on connected. This may result in
    // service discovery failure when the peer device is of other Gen3 platform.
    if (connection->info.role == BLE_ROLE_CENTRAL) {
        connecting_ = false;
        os_semaphore_give(connectSemaphore_, false);
    }
    connection->info.att_mtu = mtuSize;
    hal_ble_link_evt_t evt = {};
    evt.type = BLE_EVT_ATT_MTU_UPDATED;
    evt.conn_handle = connHandle;
    evt.params.att_mtu_updated.att_mtu_size = mtuSize;
    notifyLinkEvent(evt);
}

void BleGap::handleConnParamsUpdated(uint8_t connHandle, uint8_t status, uint16_t cause) {
    BleConnection* connection = fetchConnection(connHandle);
    if (!connection) {
        return;
    }
    switch (status) {
        case GAP_CONN_PARAM_UPDATE_STATUS_SUCCESS: {
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connection->info.conn_params.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connection->info.conn_params.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connection->info.conn_params.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connection->info.conn_params.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "handleConnParamsUpdated: update success: interval:0x%x, latency:0x%x, timeout:0x%x",
                            connection->info.conn_params.max_conn_interval, connection->info.conn_params.slave_latency, connection->info.conn_params.conn_sup_timeout);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_FAIL: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update failed: cause 0x%x", cause);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_PENDING: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update pending: conn_id %d", connHandle);
            break;
        }
        default: break;
    }
}

